In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
#Creating a #Seriesby passing a list of values, letting pandas create a default integer index

In [16]:
s=pd.Series([1,2,3,np.nan,5,6])

In [17]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64

In [18]:
#Creating a DataFrameby passing a numpy array, with a datetime index and labeled columns

In [19]:
dates=pd.date_range('20230202',periods=8)

In [20]:
dates

DatetimeIndex(['2023-02-02', '2023-02-03', '2023-02-04', '2023-02-05',
               '2023-02-06', '2023-02-07', '2023-02-08', '2023-02-09'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df=pd.DataFrame(np.random.randn(8,4), index=dates,columns=('A','B','C','D'))

In [22]:
df

                   A         B         C         D
2023-02-02  0.781687 -0.144852  0.369145 -0.449051
2023-02-03 -2.124750  0.230910  1.647256  0.326528
2023-02-04 -0.056833 -0.328209 -0.104489  0.664616
2023-02-05 -2.192784  0.492167  0.664405 -0.018719
2023-02-06  1.308745 -0.603420  0.822724 -1.030479
2023-02-07 -0.462398 -0.272734  0.010598  0.265294
2023-02-08  1.187461  0.118086 -0.517469  0.489792
2023-02-09 -0.468160  0.616962  0.630218  0.650224

In [23]:
 df2 = pd.DataFrame({ 'A' : 1.,
                      'B' : pd.Timestamp('20130102'), 
                      'C' : pd.Series(1,index=list(range(4)),dtype='float32')
                      'D' : np.array([3] * 4,dtype='int32'),
                      'E' : pd.Categorical(["test","train","test","train"])
                      'F' : 'foo' })

SyntaxError: invalid syntax (2768640324.py, line 4)

In [24]:
df2.<TAB>

SyntaxError: invalid syntax (2763397827.py, line 1)

In [25]:
df.head()

                   A         B         C         D
2023-02-02  0.781687 -0.144852  0.369145 -0.449051
2023-02-03 -2.124750  0.230910  1.647256  0.326528
2023-02-04 -0.056833 -0.328209 -0.104489  0.664616
2023-02-05 -2.192784  0.492167  0.664405 -0.018719
2023-02-06  1.308745 -0.603420  0.822724 -1.030479

In [26]:
df.tail(2)

                   A         B         C         D
2023-02-08  1.187461  0.118086 -0.517469  0.489792
2023-02-09 -0.468160  0.616962  0.630218  0.650224

In [27]:
df.index

DatetimeIndex(['2023-02-02', '2023-02-03', '2023-02-04', '2023-02-05',
               '2023-02-06', '2023-02-07', '2023-02-08', '2023-02-09'],
              dtype='datetime64[ns]', freq='D')

In [28]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [29]:
df.values

array([[ 0.7816872 , -0.14485197,  0.36914534, -0.44905059],
       [-2.12475032,  0.23090988,  1.64725643,  0.32652794],
       [-0.05683295, -0.32820879, -0.10448905,  0.66461626],
       [-2.19278399,  0.49216737,  0.66440536, -0.01871858],
       [ 1.30874531, -0.60341997,  0.82272408, -1.03047945],
       [-0.46239828, -0.27273357,  0.01059794,  0.2652937 ],
       [ 1.18746074,  0.11808613, -0.51746939,  0.48979185],
       [-0.46816025,  0.61696177,  0.6302178 ,  0.65022396]])

In [30]:
df.describe()

              A         B         C         D
count  8.000000  8.000000  8.000000  8.000000
mean  -0.253379  0.013614  0.440299  0.112276
std    1.361689  0.423565  0.664735  0.590936
min   -2.192784 -0.603420 -0.517469 -1.030479
25%   -0.882308 -0.286602 -0.018174 -0.126302
50%   -0.259616 -0.013383  0.499682  0.295911
75%    0.883131  0.296224  0.703985  0.529900
max    1.308745  0.616962  1.647256  0.664616

In [31]:
df.T

,2023-02-02,2023-02-03,2023-02-04,2023-02-05,2023-02-06,2023-02-07,2023-02-08,2023-02-09
A,0.781687,-2.124750,-0.056833,-2.192784,1.308745,-0.462398,1.187461,-0.468160
B,-0.144852,0.230910,-0.328209,0.492167,-0.603420,-0.272734,0.118086,0.616962
C,0.369145,1.647256,-0.104489,0.664405,0.822724,0.010598,-0.517469,0.630218
D,-0.449051,0.326528,0.664616,-0.018719,-1.030479,0.265294,0.489792,0.650224

In [32]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2023-02-02  0.781687 -0.144852  0.369145 -0.449051
2023-02-03 -2.124750  0.230910  1.647256  0.326528
2023-02-04 -0.056833 -0.328209 -0.104489  0.664616
2023-02-05 -2.192784  0.492167  0.664405 -0.018719
2023-02-06  1.308745 -0.603420  0.822724 -1.030479
2023-02-07 -0.462398 -0.272734  0.010598  0.265294
2023-02-08  1.187461  0.118086 -0.517469  0.489792
2023-02-09 -0.468160  0.616962  0.630218  0.650224

In [33]:
df.sort_values(by='B')

                   A         B         C         D
2023-02-06  1.308745 -0.603420  0.822724 -1.030479
2023-02-04 -0.056833 -0.328209 -0.104489  0.664616
2023-02-07 -0.462398 -0.272734  0.010598  0.265294
2023-02-02  0.781687 -0.144852  0.369145 -0.449051
2023-02-08  1.187461  0.118086 -0.517469  0.489792
2023-02-03 -2.124750  0.230910  1.647256  0.326528
2023-02-05 -2.192784  0.492167  0.664405 -0.018719
2023-02-09 -0.468160  0.616962  0.630218  0.650224

In [34]:
#Selection

In [35]:
#Getting

In [36]:
df['A']

2023-02-02    0.781687
2023-02-03   -2.124750
2023-02-04   -0.056833
2023-02-05   -2.192784
2023-02-06    1.308745
2023-02-07   -0.462398
2023-02-08    1.187461
2023-02-09   -0.468160
Freq: D, Name: A, dtype: float64

In [37]:
df[0:3]

                   A         B         C         D
2023-02-02  0.781687 -0.144852  0.369145 -0.449051
2023-02-03 -2.124750  0.230910  1.647256  0.326528
2023-02-04 -0.056833 -0.328209 -0.104489  0.664616

In [38]:
df.loc[dates[0]]

A    0.781687
B   -0.144852
C    0.369145
D   -0.449051
Name: 2023-02-02 00:00:00, dtype: float64

In [39]:
df.loc[:,['A','B']]

                   A         B
2023-02-02  0.781687 -0.144852
2023-02-03 -2.124750  0.230910
2023-02-04 -0.056833 -0.328209
2023-02-05 -2.192784  0.492167
2023-02-06  1.308745 -0.603420
2023-02-07 -0.462398 -0.272734
2023-02-08  1.187461  0.118086
2023-02-09 -0.468160  0.616962

In [40]:
df.loc['20230202':'20230205',['C','B']]

                   C         B
2023-02-02  0.369145 -0.144852
2023-02-03  1.647256  0.230910
2023-02-04 -0.104489 -0.328209
2023-02-05  0.664405  0.492167

In [41]:
df.loc['20230202',['A','B']]

A    0.781687
B   -0.144852
Name: 2023-02-02 00:00:00, dtype: float64

In [42]:
df.loc[dates[0],'A']

0.7816871972073125

In [43]:
df.at[dates[0],'A']

0.7816871972073125

In [44]:
#Selection by Position

In [66]:
df.iloc[3]

A    0.965780
B   -1.395614
C   -0.703026
D    0.422083
Name: 2023-02-05 00:00:00, dtype: float64

In [45]:
df.iloc[3:6,0:2]

                   A         B
2023-02-05 -2.192784  0.492167
2023-02-06  1.308745 -0.603420
2023-02-07 -0.462398 -0.272734

In [46]:
df.iloc[[1,2,4],[0,1]]

                   A         B
2023-02-03 -2.124750  0.230910
2023-02-04 -0.056833 -0.328209
2023-02-06  1.308745 -0.603420

In [47]:
df.iloc[1:4,:]

                   A         B         C         D
2023-02-03 -2.124750  0.230910  1.647256  0.326528
2023-02-04 -0.056833 -0.328209 -0.104489  0.664616
2023-02-05 -2.192784  0.492167  0.664405 -0.018719

In [48]:
df.iloc[:,1:5]

                   B         C         D
2023-02-02 -0.144852  0.369145 -0.449051
2023-02-03  0.230910  1.647256  0.326528
2023-02-04 -0.328209 -0.104489  0.664616
2023-02-05  0.492167  0.664405 -0.018719
2023-02-06 -0.603420  0.822724 -1.030479
2023-02-07 -0.272734  0.010598  0.265294
2023-02-08  0.118086 -0.517469  0.489792
2023-02-09  0.616962  0.630218  0.650224

In [49]:
df.iloc[1,1]

0.23090987705577276

In [50]:
df.iat[1,1]

0.23090987705577276

In [51]:
df.iloc[0,0]

0.7816871972073125

In [52]:
df[df>0]

                   A         B         C         D
2023-02-02  0.781687       NaN  0.369145       NaN
2023-02-03       NaN  0.230910  1.647256  0.326528
2023-02-04       NaN       NaN       NaN  0.664616
2023-02-05       NaN  0.492167  0.664405       NaN
2023-02-06  1.308745       NaN  0.822724       NaN
2023-02-07       NaN       NaN  0.010598  0.265294
2023-02-08  1.187461  0.118086       NaN  0.489792
2023-02-09       NaN  0.616962  0.630218  0.650224

In [53]:
df[df.A>0]

                   A         B         C         D
2023-02-02  0.781687 -0.144852  0.369145 -0.449051
2023-02-06  1.308745 -0.603420  0.822724 -1.030479
2023-02-08  1.187461  0.118086 -0.517469  0.489792

In [54]:
df2=df.copy()

In [55]:
df2

                   A         B         C         D
2023-02-02  0.781687 -0.144852  0.369145 -0.449051
2023-02-03 -2.124750  0.230910  1.647256  0.326528
2023-02-04 -0.056833 -0.328209 -0.104489  0.664616
2023-02-05 -2.192784  0.492167  0.664405 -0.018719
2023-02-06  1.308745 -0.603420  0.822724 -1.030479
2023-02-07 -0.462398 -0.272734  0.010598  0.265294
2023-02-08  1.187461  0.118086 -0.517469  0.489792
2023-02-09 -0.468160  0.616962  0.630218  0.650224

df2

In [56]:
df2

                   A         B         C         D
2023-02-02  0.781687 -0.144852  0.369145 -0.449051
2023-02-03 -2.124750  0.230910  1.647256  0.326528
2023-02-04 -0.056833 -0.328209 -0.104489  0.664616
2023-02-05 -2.192784  0.492167  0.664405 -0.018719
2023-02-06  1.308745 -0.603420  0.822724 -1.030479
2023-02-07 -0.462398 -0.272734  0.010598  0.265294
2023-02-08  1.187461  0.118086 -0.517469  0.489792
2023-02-09 -0.468160  0.616962  0.630218  0.650224

In [57]:
sl=pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))

In [58]:
sl

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [59]:
df['F']=sl

In [60]:
sl

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [65]:
df.loc[dates[4],'A']=0

In [ ]:
#df.at[dates[4],'A']=0

In [66]:
df

                   A         B         C         D   F
2023-02-02  0.000000 -0.144852  0.369145 -0.449051 NaN
2023-02-03  0.000000  0.230910  1.647256  0.326528 NaN
2023-02-04 -0.056833 -0.328209 -0.104489  0.664616 NaN
2023-02-05 -2.192784  0.492167  0.664405 -0.018719 NaN
2023-02-06  0.000000 -0.603420  0.822724 -1.030479 NaN
2023-02-07 -0.462398 -0.272734  0.010598  0.265294 NaN
2023-02-08  1.187461  0.118086 -0.517469  0.489792 NaN
2023-02-09 -0.468160  0.616962  0.630218  0.650224 NaN

In [69]:
df.iat[0,1]=0

In [70]:
df

                   A         B         C         D   F
2023-02-02  0.000000  0.000000  0.369145 -0.449051 NaN
2023-02-03  0.000000  0.230910  1.647256  0.326528 NaN
2023-02-04 -0.056833 -0.328209 -0.104489  0.664616 NaN
2023-02-05 -2.192784  0.492167  0.664405 -0.018719 NaN
2023-02-06  0.000000 -0.603420  0.822724 -1.030479 NaN
2023-02-07 -0.462398 -0.272734  0.010598  0.265294 NaN
2023-02-08  1.187461  0.118086 -0.517469  0.489792 NaN
2023-02-09 -0.468160  0.616962  0.630218  0.650224 NaN

In [71]:
df.iat[0,3]=0

In [72]:
df

                   A         B         C         D   F
2023-02-02  0.000000  0.000000  0.369145  0.000000 NaN
2023-02-03  0.000000  0.230910  1.647256  0.326528 NaN
2023-02-04 -0.056833 -0.328209 -0.104489  0.664616 NaN
2023-02-05 -2.192784  0.492167  0.664405 -0.018719 NaN
2023-02-06  0.000000 -0.603420  0.822724 -1.030479 NaN
2023-02-07 -0.462398 -0.272734  0.010598  0.265294 NaN
2023-02-08  1.187461  0.118086 -0.517469  0.489792 NaN
2023-02-09 -0.468160  0.616962  0.630218  0.650224 NaN

In [73]:
df.loc[:,'D']

2023-02-02    0.000000
2023-02-03    0.326528
2023-02-04    0.664616
2023-02-05   -0.018719
2023-02-06   -1.030479
2023-02-07    0.265294
2023-02-08    0.489792
2023-02-09    0.650224
Freq: D, Name: D, dtype: float64

In [78]:
len(df)

8

In [79]:
df.loc[:,'D'] = np.array([5] * len(df))

In [80]:
df

                   A         B         C  D   F
2023-02-02  0.000000  0.000000  0.369145  5 NaN
2023-02-03  0.000000  0.230910  1.647256  5 NaN
2023-02-04 -0.056833 -0.328209 -0.104489  5 NaN
2023-02-05 -2.192784  0.492167  0.664405  5 NaN
2023-02-06  0.000000 -0.603420  0.822724  5 NaN
2023-02-07 -0.462398 -0.272734  0.010598  5 NaN
2023-02-08  1.187461  0.118086 -0.517469  5 NaN
2023-02-09 -0.468160  0.616962  0.630218  5 NaN

In [83]:
[5]*8

[5, 5, 5, 5, 5, 5, 5, 5]

In [86]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [87]:
df1

                   A         B         C  D   F   E
2023-02-02  0.000000  0.000000  0.369145  5 NaN NaN
2023-02-03  0.000000  0.230910  1.647256  5 NaN NaN
2023-02-04 -0.056833 -0.328209 -0.104489  5 NaN NaN
2023-02-05 -2.192784  0.492167  0.664405  5 NaN NaN

In [89]:
list(df.columns)+['E']

['A', 'B', 'C', 'D', 'F', 'E']

In [91]:
df1.loc[dates[0]:dates[2],'E']=1

In [92]:
df1

                   A         B         C  D   F    E
2023-02-02  0.000000  0.000000  0.369145  5 NaN  1.0
2023-02-03  0.000000  0.230910  1.647256  5 NaN  1.0
2023-02-04 -0.056833 -0.328209 -0.104489  5 NaN  1.0
2023-02-05 -2.192784  0.492167  0.664405  5 NaN  NaN

In [94]:
df1.loc[dates[1]:dates[2],'F']=1

In [95]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2023-02-03  0.000000  0.230910  1.647256  5  1.0  1.0
2023-02-04 -0.056833 -0.328209 -0.104489  5  1.0  1.0

In [96]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2023-02-02  0.000000  0.000000  0.369145  5  5.0  1.0
2023-02-03  0.000000  0.230910  1.647256  5  1.0  1.0
2023-02-04 -0.056833 -0.328209 -0.104489  5  1.0  1.0
2023-02-05 -2.192784  0.492167  0.664405  5  5.0  5.0

In [97]:
pd.isnull(df1)

                A      B      C      D      F      E
2023-02-02  False  False  False  False   True  False
2023-02-03  False  False  False  False  False  False
2023-02-04  False  False  False  False  False  False
2023-02-05  False  False  False  False   True   True

In [98]:
df.mean()

A   -0.249089
B    0.031720
C    0.440299
D    5.000000
F         NaN
dtype: float64

In [99]:
df.mean(1)

2023-02-02    1.342286
2023-02-03    1.719542
2023-02-04    1.127617
2023-02-05    0.990947
2023-02-06    1.304826
2023-02-07    1.068867
2023-02-08    1.447019
2023-02-09    1.444755
Freq: D, dtype: float64

In [104]:
df.apply(np.cumsum)

                   A         B         C   D   F
2023-02-02  0.000000  0.000000  0.369145   5 NaN
2023-02-03  0.000000  0.230910  2.016402  10 NaN
2023-02-04 -0.056833 -0.097299  1.911913  15 NaN
2023-02-05 -2.249617  0.394868  2.576318  20 NaN
2023-02-06 -2.249617 -0.208552  3.399042  25 NaN
2023-02-07 -2.712015 -0.481285  3.409640  30 NaN
2023-02-08 -1.524554 -0.363199  2.892171  35 NaN
2023-02-09 -1.992715  0.253763  3.522389  40 NaN

In [106]:
df.apply(lambda x: x.max() - x.min())

A    3.380245
B    1.220382
C    2.164726
D    0.000000
F         NaN
dtype: float64

In [107]:
 s = pd.Series(np.random.randint(0, 7, size=10))

In [108]:
s

0    2
1    6
2    1
3    5
4    6
5    2
6    0
7    2
8    3
9    4
dtype: int32

In [109]:
s.value_counts()

2    3
6    2
1    1
5    1
0    1
3    1
4    1
dtype: int64

In [111]:
s=pd.Series(['A','B','C','Aaba','Baca',np.nan,'CABA','dog','cat'])

In [112]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [113]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [114]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

In [115]:
df=pd.DataFrame(np.random.randn(10,4))

In [116]:
df

          0         1         2         3
0  0.059757  1.783383  0.234255  1.298206
1 -0.833891 -1.787618  1.439851 -1.296114
2  0.266282  0.207219  0.322572  0.192870
3  0.298029 -0.518179 -0.654564 -0.110687
4  0.413460  0.655103  1.116641  0.685240
5 -0.600334 -1.583823 -0.442232  2.314757
6 -0.448268  0.775683 -0.092407  0.577171
7  1.876605  0.518671 -2.785808 -0.459245
8 -0.790045  0.483145 -2.001207 -0.381187
9  0.863507  2.654330  1.363023  0.560249

In [118]:
pieces=[df[:3],df[3:7],df[7:]]

In [119]:
pieces

[          0         1         2         3
 0  0.059757  1.783383  0.234255  1.298206
 1 -0.833891 -1.787618  1.439851 -1.296114
 2  0.266282  0.207219  0.322572  0.192870,
           0         1         2         3
 3  0.298029 -0.518179 -0.654564 -0.110687
 4  0.413460  0.655103  1.116641  0.685240
 5 -0.600334 -1.583823 -0.442232  2.314757
 6 -0.448268  0.775683 -0.092407  0.577171,
           0         1         2         3
 7  1.876605  0.518671 -2.785808 -0.459245
 8 -0.790045  0.483145 -2.001207 -0.381187
 9  0.863507  2.654330  1.363023  0.560249]

In [120]:
pd.concat(pieces)

          0         1         2         3
0  0.059757  1.783383  0.234255  1.298206
1 -0.833891 -1.787618  1.439851 -1.296114
2  0.266282  0.207219  0.322572  0.192870
3  0.298029 -0.518179 -0.654564 -0.110687
4  0.413460  0.655103  1.116641  0.685240
5 -0.600334 -1.583823 -0.442232  2.314757
6 -0.448268  0.775683 -0.092407  0.577171
7  1.876605  0.518671 -2.785808 -0.459245
8 -0.790045  0.483145 -2.001207 -0.381187
9  0.863507  2.654330  1.363023  0.560249

In [121]:
left=pd.DataFrame({'key':['foo','foo'],'lval':[1,2]})

In [122]:
left

   key  lval
0  foo     1
1  foo     2

In [123]:
right=pd.DataFrame({'key':['foo','foo'],'lval':[4,5]})

In [124]:
right

   key  lval
0  foo     4
1  foo     5

In [125]:
df=pd.DataFrame(np.random.randn(8,4),columns=['A','B','C','D'])

In [126]:
df

          A         B         C         D
0  0.318063 -0.140024  0.573046  2.269956
1 -0.601322 -0.133527 -0.082446  0.329966
2 -0.909756  0.420760 -1.518585 -0.953904
3 -1.484143  1.271122 -0.277594  2.174210
4 -0.910162  0.436971  0.686353 -1.183539
5  0.413849  1.116396 -0.163645  0.633838
6  0.421300 -1.197002  2.742752 -0.061365
7 -2.298392 -0.001145  0.146887 -0.878077

In [127]:
s=df.iloc[3]

In [128]:
s

A   -1.484143
B    1.271122
C   -0.277594
D    2.174210
Name: 3, dtype: float64

In [129]:
df.append(s,ignore_index=True)

C:\Users\shrey\AppData\Local\Temp\ipykernel_6272\1925300445.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(s,ignore_index=True)

          A         B         C         D
0  0.318063 -0.140024  0.573046  2.269956
1 -0.601322 -0.133527 -0.082446  0.329966
2 -0.909756  0.420760 -1.518585 -0.953904
3 -1.484143  1.271122 -0.277594  2.174210
4 -0.910162  0.436971  0.686353 -1.183539
5  0.413849  1.116396 -0.163645  0.633838
6  0.421300 -1.197002  2.742752 -0.061365
7 -2.298392 -0.001145  0.146887 -0.878077
8 -1.484143  1.271122 -0.277594  2.174210

In [133]:
df=pd.DataFrame({'A':['foo','bar','foo','bar','foo','bar','foo','foo'],
                 'B':['one','one','two','three','two','one','three','four'],
                 'C':np.random.randn(8),
                 'D':np.random.randn(8)})

In [134]:
df

     A      B         C         D
0  foo    one  0.977961  0.262066
1  bar    one  2.411721 -0.141575
2  foo    two  1.029066  0.782481
3  bar  three -2.064708  0.026524
4  foo    two -0.334142 -0.415285
5  bar    one  0.146398 -0.961612
6  foo  three  0.167416 -0.124956
7  foo   four -1.139198 -0.543729

In [135]:
df.groupby('A').sum()

            C         D
A
bar  0.493411 -1.076663
foo  0.701103 -0.039423

In [136]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    2.558119 -1.103187
    three -2.064708  0.026524
foo four  -1.139198 -0.543729
    one    0.977961  0.262066
    three  0.167416 -0.124956
    two    0.694924  0.367195

In [142]:
 tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
'foo', 'foo', 'qux', 'qux'],
['one', 'two', 'one', 'two',
'one', 'two', 'one', 'two']]))

In [143]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [144]:
index=pd.MultiIndex.from_tuples(tuples,names=['first','second'])

In [145]:
df=pd.DataFrame(np.random.randn(8,2))

In [146]:
df

                     A         B
first second
bar   one    -0.306510  0.989058
      two    -0.658595 -1.218309
baz   one    -1.437617  1.404286
      two     0.376551 -1.531583
foo   one     1.063184  0.092633
      two     0.516110  0.471941
qux   one    -1.012807  0.180631
      two    -0.418060  0.987295

In [147]:
 df2 = df[:4]

In [148]:
df2

                     A         B
first second
bar   one    -0.306510  0.989058
      two    -0.658595 -1.218309
baz   one    -1.437617  1.404286
      two     0.376551 -1.531583

In [149]:
 stacked = df2.stack()

In [150]:
stacked

first  second
bar    one     A   -0.306510
               B    0.989058
       two     A   -0.658595
               B   -1.218309
baz    one     A   -1.437617
               B    1.404286
       two     A    0.376551
               B   -1.531583
dtype: float64

In [152]:
unstacked=df2.unstack()

In [153]:
df2

                     A         B
first second
bar   one    -0.306510  0.989058
      two    -0.658595 -1.218309
baz   one    -1.437617  1.404286
      two     0.376551 -1.531583

In [154]:
df2.unstack(0)

               A                   B
first        bar       baz       bar       baz
second
one    -0.306510 -1.437617  0.989058  1.404286
two    -0.658595  0.376551 -1.218309 -1.531583

In [157]:
 df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
 'B' : ['A', 'B', 'C'] * 4,
 'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
 'D' : np.random.randn(12),
 'E' : np.random.randn(12)})

In [158]:
df

        A  B    C         D         E
0     one  A  foo -0.505452  1.600782
1     one  B  foo -0.160185  0.328930
2     two  C  foo  1.542579 -0.705914
3   three  A  bar -1.996335  0.545986
4     one  B  bar -1.079343 -1.196209
5     one  C  bar  0.030159 -0.269255
6     two  A  foo  0.703534  3.904578
7   three  B  foo -0.678815 -0.761068
8     one  C  foo -0.101380  0.264396
9     one  A  bar  0.557026  0.440817
10    two  B  bar -0.454896 -1.787285
11  three  C  bar  1.032341  0.179440

In [161]:
 pd.pivot_table(df, values=['E','D'], index=['A', 'B'], columns=['C'])

                D                   E
C             bar       foo       bar       foo
A     B
one   A  0.557026 -0.505452  0.440817  1.600782
      B -1.079343 -0.160185 -1.196209  0.328930
      C  0.030159 -0.101380 -0.269255  0.264396
three A -1.996335       NaN  0.545986       NaN
      B       NaN -0.678815       NaN -0.761068
      C  1.032341       NaN  0.179440       NaN
two   A       NaN  0.703534       NaN  3.904578
      B -0.454896       NaN -1.787285       NaN
      C       NaN  1.542579       NaN -0.705914